import 'package:flutter/material.dart';
import 'package:athkar/screens/pagemodel.dart';

class AyatKorsi extends StatefulWidget {
  @override
  _AyatKorsiState createState() => _AyatKorsiState();
}

class _AyatKorsiState extends State<AyatKorsi> {
  List<PageModel> pages;

//  void _addPages() {
//    pages = List<PageModel>();
//    pages.add(PageModel(
//      '',
//      '',
//      '',
//      '',
//      '',
//      'اية الكرسي',
//      'هل من الواجب أن يبدأ من أراد قراءة القرآن بقول:\n (بسم الله الرحمن الرحيم) حتى إذا كان من وسط السورة، وأحياناً يريد الواحد منا أن يردد بعض السور ثلاث مرات، هل عليه أن يقول في كل مرة: ( بسم الله الرحمن الرحيم)، أم مرةً واحدةً تكفي؟\n\n '
//          '  السنة للمؤمن والمؤمنة البداءة بالبسملة في أول كل سورة وإن كررها ذلك يكرر التسمية ،\n بسم الله الرحمن الرحيم في أول كل سورة،\n كان النبي صلى الله عليه وسلم إذا قرأ السورة بدأها ببسم الله الرحمن الرحيم،\n وقد أنزل الله ذلك مع كل سورة،\n كل سورة نزل معها بسم الله الرحمن الرحيم إلا سورة براءة،\n فإنه توقف عثمان والصحابة لما جمعوا القرآن هل هي سورة واحدة مع الأنفال،\n أو منفصلة؟،\n فلهذا لم يكتبوا بينهما آية التسمية،\n وأما ما سواها من السور،\n فالمشروع للقارئ أن يقرأ التسمية،\n وإذا كرر السور يكرر التسمية،\n أما إذا كانت البداءة أثناء السورة فإنه يبدأ بالتعوذ يقول : أعوذ بالله من الشيطان الرجيم يكفي،\n وإن سمى فلا بأس لكن يكفي التعوذ؛ لقول الله جل وعلا { فَإِذَا قَرَأْتَ الْقُرْآنَ فَاسْتَعِذْ بِاللّهِ مِنَ الشَّيْطَانِ الرَّجِيمِ } [سورة النحل - 98]،\n فإذا كانت البداية من أثناء السورة يتعوذ ويكفي،\n أما من أولها،\n فإنه يتعوذ ويسمي جميعاً،\n وإذا أعادها أعاد التسمية فقط،\n ولا يعيد التعوذ يكفيه إعادة التسمية فقط.',
//    ));
//    pages.add(PageModel(
//      '',
//      '',
//      '',
//      '',
//      '',
//      'الإخلاص والمعوذتين',
//      'في أذكار الصباح والمساء نقرأ سور الإخلاص، والمعوذتين. ثلاث مرات.\n'
//          '  هل نقرأ كل سورة ثلاثا، أم نقرأ الإخلاص مرة ثم الفلق مرة، ثم الناس مرة، ثم نكرر مرتين؟\n\n'
//          '  فلم نطلع على نص في المسألة يعين أحد الأمرين، ولكن الظاهر أن الأولى أن تقرأ السور الثلاث مرة ثم تعيد قراءتها مع بعض مرتين، ويدل لهذا أنه ثبت عن النبي صلى الله عليه وسلم في أذكار النوم أنه كان إذا أوى إلى فراشه كل ليلة جمع كفيه ثم نفث فيهما فقرأ فيهما: قل هو الله أحد، وقل أعوذ برب الفلق، وقل أعوذ برب الناس، ثم يمسح بهما ما استطاع من جسده يبدأ بهما على رأسه ووجه، وما أقبل من جسده. يفعل ذلك ثلاث مرات. رواه البخاري\n\n'
//          '  وثبت عنه صلى الله عليه وسلم أنه قال لفقراء المهاجرين: تسبحون وتحمدون وتكبرون خلف كل صلاة ثلاثا وثلاثين. متفق عليه\n\n'
//          ' وقال أبو صالح الراوي عن أبي هريرة لما سئل عن كيفية ذكرهن قال: يقول: سبحان الله، والحمد لله، والله أكبر. حتى يكون منهن كلهن ثلاثا وثلاثين، كذا في الصحيح عن ابن صالح.\n\n'
//          '   وقد رجح ابن حجر أن كلا الأمرين حسن ومال إلى أفضلية الإفراد، وذكر في ذلك حججا منها حديث زيد بن ثابت: أمرنا أن نسبح في دبر كل صلاة ثلاثا وثلاثين، ونحمد ثلاثا وثلاثين، ونكبر أربعا وثلاثين. والحديث رواه الحاكم وصححه ووافقه الذهبي. وفي حديث مسلم: من سبح في دبر كل صلاة ثلاثا وثلاثين، وحمد الله ثلاثا وثلاثين، وكبر الله ثلاثا وثلاثين، وقال تمام المائة: لا إله إلا الله وحده لا شريك له، له الملك وله الحمد وهو على كل شيء قدير. غفرت خطاياه وإن كانت مثل زبد البحر.\n\n'
//          '   فحديث أذكار النوم السابق في المعوذات ظاهره الجمع بين السور، وإعادتها مجموعة ثلاثا، وأما أحاديث التسبيحات فالظاهر أن الأفضل هو تفريقها، فلو أن الإنسان جمع أو فرق فالظاهر أن الكل لا حرج فيه، والأولى إلحاق المعوذات مساء وصباحا بالمعوذات في أذكار النوم.',
//    ));
//    pages.add(PageModel(
//        '',
//        '',
//        '',
//        '',
//        '',
//        'لا اله الا الله وحده لا شريك له ...',
//        'الحمد لله والصلاة والسلام على رسول الله وعلى آله وصحبه، أما بعـد:'
//            '   فان قول:'
//            '  لا إله إلا الله وحده لا شريك له ... قد ثبت فيه قوله صلى الله عليه وسلم: من قال إذا أصبح: لا إله إلا الله وحده لا شريك له له الملك وله'
//            ' الحمد وهو على كل شيء قدير كان له عدل رقبة من ولد إسماعيل، وكتب له عشر حسنات وحط عنه عشر سيئات، ورفع له عشر درجات وكان في حرز من ا'
//            ' لشيطان حتى يمسي، وإن قالها إذا أمسى كان له مثل ذلك حتى يصبح. رو'
//            'اه أبو داود وصححه الألباني.\n\n'
//            '   وهذا الحديث لم يخصص الذكر المذكور بعدد معين ولكنه ثبت الترغيب في الإتيان بهذا الذكر عشر مرات بعد صلاة الفجر والمغرب مباشرة، وثبت الترغيب في الإتيان به عشر مرات بعد صلاة الفجر فقط، كما ثبت الترغيب في الإتيان به مائة مرة في اليوم غير مقيد بوقت، ففي الصحيحين من حديث أبي هريرة رضي الله عنه أن النبي صلى الله عليه وسلم قال: من قال لا إله إلا الله وحده لا شريك له له الملك وله الحمد وهو على كل شيء قدير في يوم مائة مرة كانت له عدل عشر رقاب، وكتبت له مائة حسنة، ومحيت عنه مائة سيئة، وكانت له حرزاً من الشيطان يومه ذلك حتى يمسي، ولم يأت أحد بأفضل مما جاء به إلا أحد عمل أكثر من ذلك.\n\n'
//            '   وفي الحديث: من قال : لا إله إلا الله وحده لا شريك له له الملك وله الحمد وهو على كل شيء قدير بعد ما يصلي الغداة عشر مرات كتب الله عز وجل له عشر حسنات ومحا عنه عشر سيئات ورفع له عشر درجات وكن له بعدل عتق رقبتين من ولد إسماعيل، فإن قالها حين يمسي كان له مثل ذلك وكن له حجابا من الشيطان حتى يصبح. أخرجه الخطيب، وصححه الألباني في السلسلة الصحيحة.\n\n'
//            '    وفي الحديث: من قال قبل أن ينصرف ويثني رجليه من صلاة المغرب والصبح: لا إله إلا الله وحده لا شريك له له الملك وله الحمد يحيي ويميت وهو على كل شيء قدير عشر مرات كتب الله له بكل واحدة عشر حسنات ومحا عنه عشر سيئات ورفع له عشر درجات، وكانت له حرزا من كل مكروه وحرزا من الشيطان الرجيم، ولم يحل لذنب أن يدركه إلا الشرك، وكان من أفضل الناس عملا؛ إلا رجلا يفضله بقوله أفضل مما قال. رواه أحمد وقال الهيثمي والمنذري: رجاله رجال الصحيح غير شهر بن حوشب. وقال الألباني: حسن لغيره.\n\n'
//            '   وقد بوب ابن السني والمنذري والهيثمي على الإتيان بهذا الذكر بعد الصلاة وذكروا هذا الحديث في ذلك. فظاهر الأحاديث هو حصول هذا الفضل لمن عمل بأي واحد من الأحاديث المذكورة، والأولى هو المواظبة على إكمال المائة، سواء فرقها أو جمعها، والأولى أن تكون أول النهار مع المواظبة على العشر التي تقال بعد الفجر والمغرب.\n\n'
//            '   قال النووي في شرحه على قوله صلى الله عليه وسلم: من قال لا إله إلا الله، وحده لا شريك له، له الملك وله الحمد، وهو على كل شيء قدير. في يوم مائة مرة كانت له عدل عشر رقاب، وكتبت له مائة حسنة، ومحيت عنه مائة سيئة، وكانت له حرزا من الشيطان يومه ذلك حتى يمسي، ولم يأت أحد أفضل مما جاء به إلا أحد عمل أكثر من ذلك، ومن قال سبحان الله وبحمده في يوم مائة مرة حطت خطاياه ولو كانت مثل زبد البحر.\n\n'
//            '    قال رحمه الله: وظاهر إطلاق الحديث أنه يحصل هذا الأجر المذكور في هذا الحديث من قال هذا التهليل مائة مرة في يومه، سواء قاله متوالية أو متفرقة، في مجالس، أو بعضها أول النهار، وبعضها آخره، لكن الأفضل أن يأتي بها متوالية في أول النهار ليكون حرزا له في جميع نهاره.'));
//  }

  @override
  Widget build(BuildContext context) {
//    _addPages();
    return Scaffold(
      body: Stack(
        children: <Widget>[
          Scaffold(
            appBar: AppBar(
              backgroundColor: Color.fromRGBO(43, 43, 43, 43),
            ),
            backgroundColor: Color.fromRGBO(43, 43, 43, 1),
            body: PageView.builder(
              itemBuilder: (context, index) {
                return Stack(
                  children: <Widget>[
                    ListView(
                      children: <Widget>[
                        Column(
                          children: <Widget>[
                            Padding(
                              padding: const EdgeInsets.only(top: 20),
                              // t7rok elzekr
                              child: Padding(
                                padding: const EdgeInsets.only(
                                    left: 25, right: 25, bottom: 20),
                                //t7rok elword
                                child: Text(
                                  pages[index].m3lomat2,
                                  style: TextStyle(
                                    color: Colors.grey.shade50,
                                    fontSize: 22.2,
                                    height: 1.1,
                                  ),
                                  textAlign: TextAlign.center,
                                  textDirection: TextDirection.rtl,
                                ),
                              ),
                            ),
                            Container(
                              height: 2,
                              color: Colors.lightBlueAccent,
                            ),
                            Padding(
                              padding: const EdgeInsets.only(top: 20),
                              // t7rok elzekr
                              child: Padding(
                                padding: const EdgeInsets.only(
                                    left: 25, right: 25), //t7rok elword
                                child: Text(
                                  pages[index].m3lomat,
                                  style: TextStyle(
                                    color: Colors.grey.shade50,
                                    fontSize: 22.2,
                                    height: 1.1,
                                  ),
                                  textAlign: TextAlign.right,
                                  textDirection: TextDirection.ltr,
                                ),
                              ),
                            ),
                            SizedBox(
                              height: 63,
                            )
                          ],
                        ),
                      ],
                    ),
                  ],
                );
              },
              itemCount: pages.length,
            ),
          ),
        ],
      ),
    );
  }
}
